
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Реквизит3 = 50;
	Реквизит2 = "Это текст в поле ввода";
	
	Массив = Новый Массив;
	Массив.Добавить("Привет ");
	Массив.Добавить(Новый ФорматированнаяСтрока("мир", Новый Шрифт("Comic Sans MS"),ЦветаСтиля.ЦветВажного, ЦветаСтиля.ЦветФонаВыделенияПоля));
	Массив.Добавить("!");
	
	Реквизит14 = Новый ФорматированнаяСтрока(Массив);       

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСообщить(Команда)
	Сообщить("Это текст сообщения", СтатусСообщения.ОченьВажное);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСостояние(Команда)
	Состояние("Это текст состояния", 30, "Это текст пояснения", БиблиотекаКартинок.БизнесПроцесс);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредупреждение(Команда)
	ПоказатьПредупреждение(,"Это текст предупреждения", 60, "Это заголовок");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВопрос(Команда)
	Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект);
	ПоказатьВопрос(  Оповещение, "Это текст вопроса", РежимДиалогаВопрос.ДаНетОтмена,60, КодВозвратаДиалога.Да, "Это заголовок", КодВозвратаДиалога.Отмена)
КонецПроцедуры      

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДопПараметры) Экспорт
	  Сообщить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИсключение(Команда)
	ВызватьИсключение "Это текст исключения";
КонецПроцедуры

&НаКлиенте
Процедура КомандаСообщениеПользователю(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Поле = "Реквизит2";
	Сообщение.Текст = "Это текст сообщения пользователю";
	Сообщение.Сообщить();
КонецПроцедуры
